test/results/video-concurrency-test-150.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: videos-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration{name:getVideo}
    ✓ 'p(95)<2000' p(95)=1.03s

    http_req_duration{name:getVideos}
    ✓ 'p(95)<2000' p(95)=1s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4954    52.930002/s
    checks_succeeded...: 100.00% 4954 out of 4954
    checks_failed......: 0.00%   0 out of 4954

    ✓ getVideos status is 2xx
    ✓ getVideo status is 2xx

    CUSTOM
    getVideo_duration..............: avg=852.715838 min=456.808597 med=1003.758144 max=1458.235576 p(90)=1030.197894 p(95)=1038.919637
    getVideos_duration.............: avg=828.101743 min=447.707162 med=970.50911   max=1270.985676 p(90)=997.536685  p(95)=1005.87157 

    HTTP
    http_req_duration..............: avg=840.4ms    min=447.7ms    med=979.07ms    max=1.45s       p(90)=1.02s       p(95)=1.03s      
      { expected_response:true }...: avg=840.4ms    min=447.7ms    med=979.07ms    max=1.45s       p(90)=1.02s       p(95)=1.03s      
      { name:getVideo }............: avg=852.71ms   min=456.8ms    med=1s          max=1.45s       p(90)=1.03s       p(95)=1.03s      
      { name:getVideos }...........: avg=828.1ms    min=447.7ms    med=970.5ms     max=1.27s       p(90)=997.53ms    p(95)=1s         
    http_req_failed................: 0.00%  0 out of 4954
    http_reqs......................: 4954   52.930002/s

    EXECUTION
    iteration_duration.............: avg=4.69s      min=3.91s      med=4.96s       max=5.42s       p(90)=5.01s       p(95)=5.02s      
    iterations.....................: 2477   26.465001/s
    vus............................: 5      min=5         max=150
    vus_max........................: 150    min=150       max=150

    NETWORK
    data_received..................: 17 MB  178 kB/s
    data_sent......................: 411 kB 4.4 kB/s



running (1m33.6s), 000/150 VUs, 2477 complete and 0 interrupted iterations
default ✓ [======================================] 000/150 VUs  1m30s